---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationHangerSizeNotMatch
source: html/3b143519-2fe3-f1e8-f889-77a9d36a1540.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationHangerSizeNotMatch Property

The hanger size does not match the size of the host, so it can not be connected.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationHangerSizeNotMatch { get; }
```